# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]  # 6
  - [-1, 1, CBAM, [512]]  # 7
  - [-1, 1, Conv, [1024, 3, 2]]  # 8-P5/32
  - [-1, 3, C2f, [1024, True]]   # 9
  - [-1, 1, CBAM, [1024]] #10
  - [-1, 1, SPPF, [1024, 5]]  # 11

# YOLOv8.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 12
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P4    # 13
  - [-1, 3, C2f, [512]]  # 14
  - [-1, 1, CBAM, [512]]  # 15
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 16
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3      17
  - [-1, 3, C2f, [256]]  # 18 (P3/8-small)
  - [-1, 1, CBAM, [256]]  # 19
  
  - [-1, 1, Conv, [256, 3, 2]]      # 20
  - [[-1, 15], 1, Concat, [1]]  # cat head P4  21
  
  - [-1, 3, C2f, [512]]  # 22 (P4/16-medium)
  - [-1, 1, CBAM, [512]]  # 23
  - [-1, 1, Conv, [512, 3, 2]]     # 24
  - [[-1, 11], 1, Concat, [1]]  # cat head P5   25
  
  - [-1, 3, C2f, [1024]]  # 26 (P5/32-large)
  - [-1, 1, CBAM, [1024]]  #27

  - [[19, 23, 27], 1, Detect, [nc]]  # Detect(P3, P4, P5)
